junkreef/F280025C_LP_IndependentStudy_DRV8434S/F280025C_LP_IndependentStudy_DRV8434S/driverlib/fsi.h
//###########################################################################
//
// FILE:   fsi.h
//
// TITLE:  C28x FSI Driver API header file
//
//###########################################################################
// $TI Release: F28002x Support Library v3.04.00.00 $
// $Release Date: Fri Feb 12 18:58:34 IST 2021 $
// $Copyright:
// Copyright (C) 2021 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef FSI_H
#define FSI_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup fsi_api FSI
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_fsi.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//*****************************************************************************
//
// FSI Tx defines
//
//*****************************************************************************

//! \brief FSI Tx events defines
//!
//! \details Values that can be passed to APIs to enable/disable interrupts and
//!          also to set/get/clear event status on FSI Tx operation.
//!
//!          There are 4 supported interrupts related to Tx events-
//!          All are available as event status as well excecpt 4th one.
//!          1) frame transmission done
//!          2) transmit buffer is underrun
//!          3) transmit buffer is overrun
//!          4) ping counter timeout
//!
//!          Ping frame transmission upon hardware trigger(ping watchdog or
//!          external trigger) is shown as event status.
//!
#define FSI_TX_EVT_FRAME_DONE       (0x0001U)
#define FSI_TX_EVT_BUF_UNDERRUN     (0x0002U)
#define FSI_TX_EVT_BUF_OVERRUN      (0x0004U)
#define FSI_TX_EVT_PING_TIMEOUT     (0x0008U)
#define FSI_TX_EVT_PING_HW_TRIG     (0x0008U)

//! \brief Mask of all Tx Events, ORing all event defines
//!
#define FSI_TX_EVTMASK              (0x000FU)

//! \brief Maximum number of external input for triggering frame-transmission
//!
#define FSI_TX_MAX_NUM_EXT_TRIGGERS (0x0040U)

//! \brief Shifts needed to control FSI Tx interrupt generation on INT2
//!
#define FSI_TX_INT2_CTRL_S (0x8U)

//*****************************************************************************
//
// FSI Rx Defines
//
//*****************************************************************************

//! \brief FSI Rx event defines
//!
//! \details Values that can be passed to APIs to enable/disable interrupts and
//!          also to set/get/clear event status on FSI Rx operation.
//!
//!          There are 15 supported interrupts related to Rx events-
//!          All are available as event status as well.
//!          1)  ping watchdog times out
//!          2)  frame watchdog times out
//!          3)  mismatch between hardware computed CRC and received CRC.This
//!              status should be ignored if user chooses SW CRC computation
//!          4)  invalid Frame type detected
//!          5)  invalid EndofFrame bit-pattern
//!          6)  buffer Overrun in Rx buffer
//!          7)  received frame without errors
//!          8)  software reads empty Rx buffer
//!          9)  received error frame
//!          10) received ping frame
//!          11) software didn't clear FRAME_DONE flag after receiving new
//!              frame
//!          12) received data frame
//!          13) recieved ping frame with matched tag
//!          14) recieved data frame with matched tag
//!          15) recieved error frame with tag match
//!
#define FSI_RX_EVT_PING_WD_TIMEOUT       (0x0001U)
#define FSI_RX_EVT_FRAME_WD_TIMEOUT      (0x0002U)
#define FSI_RX_EVT_CRC_ERR               (0x0004U)
#define FSI_RX_EVT_TYPE_ERR              (0x0008U)
#define FSI_RX_EVT_EOF_ERR               (0x0010U)
#define FSI_RX_EVT_OVERRUN               (0x0020U)
#define FSI_RX_EVT_FRAME_DONE            (0x0040U)
#define FSI_RX_EVT_UNDERRUN              (0x0080U)
#define FSI_RX_EVT_ERR_FRAME             (0x0100U)
#define FSI_RX_EVT_PING_FRAME            (0x0200U)
#define FSI_RX_EVT_FRAME_OVERRUN         (0x0400U)
#define FSI_RX_EVT_DATA_FRAME            (0x0800U)
#define FSI_RX_EVT_PING_FRAME_TAG_MATCH  (0x1000U)
#define FSI_RX_EVT_DATA_FRAME_TAG_MATCH  (0x2000U)
#define FSI_RX_EVT_ERR_FRAME_TAG_MATCH   (0x4000U)

//! \brief Mask of all Rx Events, ORing all event defines
//!
#define FSI_RX_EVTMASK              (0x7FFFU)
//! \brief Maximum value in Rx delay line tap control
//!
#define FSI_RX_MAX_DELAY_LINE_VAL   (0x001FU)

//*****************************************************************************
//
// Common defines for both FSI Tx and Rx
//
//*****************************************************************************

//! \brief Maximum data length(16 words) for user/software defined data frame
//!
#define FSI_MAX_LEN_NWORDS_DATA     (0x000FU)

